<b>Крок 0.</b> Ініціалізація початкових параметрів.<br>
Початкове значення феромону – 1. Кількість мурах – 1.<br>
α = 1<br>
β = 1<br>
ρ = 0.4<br>
Доки не досягнуто умов виходу виконуються наступні кроки:<br>
<b>Крок 1.</b> Створення мурах.<br>
На першому кроці кожної ітерації розміщаємо всю колонію у випадкову вершину. Ймовірність розміщення колонії у вершині вираховується за формулою<br>
<img src="img/ant1.png"><br>
де n_i – кількість шляхів з вершини і, N – кількість ребер. Тобто ймовірність розміщення колонії у вершині прямо пропорційна кількості суміжних з нею вершин. Поточну вершину включимо у шлях S<br>

<b>Крок 2.</b> Пошук рішень.<br>
Вирахуємо ймовірності переходу мурахи у суміжну вершину. Ймовірність переходу у і-ту суміжну вершину:<br>
<img src="img/ant2.png"> (1)<br>
Де k_i – кількість спільних суміжних вершин з вершиною і та вершин зі шляху S, f_is- значення феромону для даного шляху.<br>
Після переходу додамо вершину у шлях та за формулою (1) вирахуємо наступний перехід. Цю операцію повторюватимемо доки не залишиться вершин, що суміжні з усіма вершинами шляху.<br>
Коли знайдено всі вершини шляху, якщо поточний шлях кращий на поточний кращий, оновлюємо його.<br>
<b>Крок 3.</b> Оновлення феромонів.<br>
Перерахуємо феромони. Для кожного ребра, що входить в шлях нове значення феромону<br>
<img src="img/ant3.png"><br>
Де L – кількість вершин у знайденому шляху, N – вершин всього.<br>
В іншому випадку:<br>
<img src="img/ant4.png"><br>

Якщо існують вершини, що зв’язані лише з однією суміжною, помітимо її як не оптимальну перерахувавши феромон як<br>
<img src="img/ant5.png"><br>
Кроки 1-3 повторюються, доки вподовж 20 ітерацій не буде покращення результату.<br>

Алгоритм є еврістичним, буде зроблено m (m ≥ 20) ітерацій, кожна з яких є лінійною.<br>